# 5.pandas入门

虽然pandas采用了大量的numpy编码风格，但二者最大的不同是pandas是专门为处理表格和混杂数据设计的。而numpy更适合处理统一的数值数组数据。

In [2]:
import pandas as pd

## 5.1pandas的数据结构

pandas有两个主要的数据结构：Series和DataFrame

### **Series**

Series是一种类似于一维数组的对象，它由一组数据以及一组与之相关的数据标签（即索引）组成。

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

#### 1.获取数组信息

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

#### 2.改变索引

In [19]:
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])

In [20]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [21]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

#### 3.获取指定值

In [22]:
obj2['a']

-5

In [23]:
obj2['d'] = 6

In [24]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [25]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [26]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [28]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [29]:
'b' in obj2

True

In [30]:
'e' in obj2

False

#### 4.创建Series

In [31]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [32]:
obj3 = pd.Series(sdata)

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

如果只传入一个字典，则结果Series中的索引就是原字典的键。可以传入排好序的字典的键来改变顺序

In [34]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [35]:
obj4 = pd.Series(sdata, index = states)

In [36]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

注：NaN即非数字，在pandas中表示缺失或NA值

#### 5.Series运算

In [37]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [38]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [39]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

#### 6.Series属性

In [41]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [42]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [43]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [44]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### **DataFrame**

DataFrame表示的是矩阵的数据表，包含已排序的列集合，每一列可以使不同的值类型。

In [2]:
import pandas as pd

In [7]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [8]:
frame = pd.DataFrame(data)

In [9]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
frame.head()

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [10]:
#指定列顺序

pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [11]:
#缺失值

frame2 = pd.DataFrame(data, columns = ['year','state','pop','debt'], 
                     index = ['one','two','three','four','five','six'])

In [12]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [13]:
#指定列，有两种方式

frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [14]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

注意：frame2[column]对于任意列名均有效，frame2.column只在列名是有效的变量名时有效

In [15]:
#嵌套字典

pop = {'Nevada': {2001:2.4,2002:2.9},
      'Ohio': {2000:1.5,2001:1.7,2002:3.6}}
frame3 = pd.DataFrame(pop)

In [16]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

对于嵌套字典，pandas会将字典的键作为列，将内部字典的键作为行索引

In [17]:
#转置

frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

## 5.2基本功能

### 1.重建索引

In [18]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index = ['d','b','a','c'])

In [19]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [20]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [21]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [22]:
obj3 = pd.Series(['blue','purple','yellow'], index = [0,2,4])

In [23]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [24]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

注：ffill向前填充，bfill向后填充

### 删除条目

In [27]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado', 'Utah', 'New York'],
                   columns = ['one','two','three','four'])

In [28]:
#删除行
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
#删除列
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [30]:
#删除列
data.drop(['two', 'four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [31]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data.drop('two', axis = 1, inplace = True)

In [33]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

注意，inplace=True会清除被删除的数据

### 3.索引、选择与过滤

In [35]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado', 'Utah', 'New York'],
                   columns = ['one','two','three','four'])

In [36]:
#单行多列
data.loc['Colorado',['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [37]:
#单行多列
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [38]:
#条件选择
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

### 4.整数索引

### 5.算数和数据对齐

In [39]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns = list('bcd'),
                  index = ['Ohio','Texas','Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
                  index = ['Utah','Ohio','Texas','Oregon'])

In [40]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

注：没有交叠的标签位置上，内部数据对齐会产生缺失值。

In [41]:
df1 = pd.DataFrame({'A': [1,2]})
df2 = pd.DataFrame({'B': [3,4]})

In [42]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [43]:
#填充
df1.add(df2, fill_value = 0)

     A    B
0  1.0  3.0
1  2.0  4.0

### 6.函数应用和映射

In [46]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'),
                  index = ['Utah','Ohio','Texas','Oregon'])

In [47]:
frame

               b         d         e
Utah   -0.932113 -0.669591 -0.613765
Ohio   -1.454489  1.759877 -1.567217
Texas  -1.069026 -0.411859  0.811805
Oregon -0.571696  0.701971 -1.205250

In [48]:
np.abs(frame)

               b         d         e
Utah    0.932113  0.669591  0.613765
Ohio    1.454489  1.759877  1.567217
Texas   1.069026  0.411859  0.811805
Oregon  0.571696  0.701971  1.205250

将函数应用到一行或一列的一维数组上

In [49]:
f  = lambda x: x.max() - x.min()

In [50]:
#计算列的极差
frame.apply(f)

b    0.882793
d    2.429468
e    2.379022
dtype: float64

In [51]:
#计算行的极差
frame.apply(f, axis = 'columns')

Utah      0.318348
Ohio      3.327095
Texas     1.880831
Oregon    1.907221
dtype: float64

In [52]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [53]:
frame.apply(f)

            b         d         e
min -1.454489 -0.669591 -1.567217
max -0.571696  1.759877  0.811805

传递给apply的函数并不一定要返回一个标量值，也可以返回带有多个值的Series

### 7.排序和排名

In [54]:
obj = pd.Series(range(4), index = ['d','a','b','c'])

In [55]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [56]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),
                    index = ['three', 'one'],
                    columns = ['d', 'a', 'b', 'c'])

In [57]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [58]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [59]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [60]:
frame = pd.DataFrame({'b': [4,7,-3,2], 'a': [0,1,0,1]})

In [61]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [62]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [63]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [64]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [65]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [66]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

## 5.3描述性统计的概述与计算

In [70]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                 [np.nan, np.nan], [0.75, -1.3]],
                 index = ['a','b','c','d'],
                 columns = ['one','two'])

In [71]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [72]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [73]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [74]:
df.mean(axis = 'columns', skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [75]:
#最值的索引值
df.idxmax()

one    b
two    d
dtype: object

In [76]:
df.idxmin()

one    d
two    b
dtype: object

In [77]:
#累积型
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [78]:
#描述性统计
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [79]:
obj = pd.Series(['a','a','b','c'] * 4)

In [80]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 1.相关性和协方差

In [ ]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume =  pd.DataFrame({ticker: data['Volume']
                     for ticker, data in all_data.items()})

In [ ]:
returns = price.pct_change

In [ ]:
returns.tail()

In [ ]:
returns.corr()

In [ ]:
returns.cov()

### 2.唯一值、计数和成员属性

In [83]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [84]:
uniques = obj.unique()

In [85]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [86]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [87]:
pd.value_counts(obj.values, sort = False)

d    1
b    2
c    3
a    3
dtype: int64

In [88]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object